app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
<h2><%= t('comments.title') %></h2>
<% @article.comments.each do |comment| %>