app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?)  [["title", "Vova article"], ["text", "Article text"], ["created_at", "2022-05-27 20:25:29.818073"], ["updated_at", "2022-05-27 20:25:29.818073"], ["author", "Vova"]]