app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "string", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "mike"], ["string", nil], ["body", "something"], ["article_id", 2], ["created_at", "2022-05-30 19:02:08.996280"], ["updated_at", "2022-05-30 19:02:08.996280"]]