app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def all
    @contacts = Contact.all

INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "vovamil@mail.ru"], ["message", "Hello"], ["created_at", "2022-05-30 19:04:12.614235"], ["updated_at", "2022-05-30 19:04:12.614235"]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save